Reports/ПлатежныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ПлатежныйКалендарь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодПросроченныхПлатежей</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодБудущихПлатежей</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОтчетУНФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ПлатежныйКалендарь/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиВариантов["Основной"].Теги = НСтр("ru='Деньги,План,Платежи';uk='Гроші,План,Платежі'");
	
	НастройкиВариантов["Основной"].Рекомендуемый = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПериодПросроченныхПлатежей.ДатаНачала > РабочаяДата Тогда
		ТекстОшибки = НСтр("ru='Период просроченных платежей не может быть больше текущей даты. Формирование отчета отменено.';uk='Період прострочених платежів не може бути більше поточної дати. Формування звіту скасоване.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			Неопределено, // ОбъектИлиСсылка
			"ПериодПросроченныхПлатежей",
			"Отчет", // ПутьКДанным
			Отказ
		);
	КонецЕсли;

	Если ПериодБудущихПлатежей.ДатаОкончания < РабочаяДата Тогда
		ТекстОшибки = НСтр("ru='Период будущих платежей не может быть меньше текущей даты. Формирование отчета отменено.';uk='Період майбутніх платежів не може бути менше поточної дати. Формування звіту скасоване.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			Неопределено, // ОбъектИлиСсылка
			"ПериодБудущихПлатежей",
			"Отчет", // ПутьКДанным
			Отказ
		);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

ЭтоОтчетУНФ = Истина;

#КонецЕсли
